SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/RF89808NVZ/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESB!ICESMSLB\/RES.LB!1543147781985!168976731!589825</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2019-06-04T11:30" ArrivalDateTime="2019-06-04T12:35" FlightNumber="6222" NumberInParty="1" ResBookDesigCode="M" Status="NN">      <DestinationLocation   LocationCode="JNB"/>      <Equipment AirEquipType="738"/>      <MarketingAirline Code="BA" FlightNumber="6222"/>      <OperatingAirline Code="MN"/>      <OriginLocation   LocationCode="DUR"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-04T17:20" ArrivalDateTime="2019-06-04T22:25" FlightNumber="763" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="NBO"/>      <Equipment AirEquipType="788"/>      <MarketingAirline Code="KQ" FlightNumber="763"/>      <OperatingAirline Code="KQ"/>      <OriginLocation   LocationCode="JNB"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-05T07:35" ArrivalDateTime="2019-06-05T08:45" FlightNumber="576" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="BGF"/>      <Equipment AirEquipType="E90"/>      <MarketingAirline Code="KQ" FlightNumber="576"/>      <OperatingAirline Code="KQ"/>      <OriginLocation   LocationCode="NBO"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-18T15:00" ArrivalDateTime="2019-06-18T20:15" FlightNumber="577" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="NBO"/>      <Equipment AirEquipType="E90"/>      <MarketingAirline Code="KQ" FlightNumber="577"/>      <OperatingAirline Code="KQ"/>      <OriginLocation   LocationCode="BGF"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-18T21:50" ArrivalDateTime="2019-06-19T01:05" FlightNumber="764" NumberInParty="1" ResBookDesigCode="E" Status="NN">      <DestinationLocation   LocationCode="JNB"/>      <Equipment AirEquipType="738"/>      <MarketingAirline Code="KQ" FlightNumber="764"/>      <OperatingAirline Code="KQ"/>      <OriginLocation   LocationCode="NBO"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2019-06-19T06:30" ArrivalDateTime="2019-06-19T07:35" FlightNumber="601" NumberInParty="1" ResBookDesigCode="C" Status="NN">      <DestinationLocation   LocationCode="DUR"/>      <Equipment AirEquipType="738"/>      <MarketingAirline Code="MN" FlightNumber="601"/>      <OperatingAirline Code="MN"/>      <OriginLocation   LocationCode="JNB"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>